/*
1) Создать список из 100 рандомных чисел в пределах 0 - 1000.
Путем операции filter() получить НОВЫЙ список из тех чисел, которые делятся на 5 без остатка
2) Используем все тот же созданный список. Отфильтровать его, чтобы там было только число 100. Попробовать достать любое из этих чисел = 100, либо вывести в консоль "Число не найдено". Подсказка - операция findAny() возвращает Optional
3) Условие из задачи №2, но достать не любое, а первое (findFirst()), либо вывести все ту же запись. Операция так же возвращает Optional.
4) Создать список из 100 рандомных String, используя UUID.randomUUID(). Отфильтровать список по условию - в строке содержится символ "а".
5) Создать список из 100 рандомных Boolean (Random.nextBoolean()). Отфильтровать 'true' и вывести в консоль количество таковых
 */

public class day1 {

}
